Flow_Over_Heated_Plate_3D/Fluid-openfoam_w_snappyhexmesh/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    Fluid_Walls
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    Coupling_Interface
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
}
